In [1]:
import sqlite3

In [2]:
conn =sqlite3.connect('Simple_db.db')

In [3]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM sqlite_master where type = "table"')

for row in cursor:
    print(row)
    
cursor.close()

('table', 'R', 'R', 2, 'CREATE TABLE R (A1 char(3), A2 char(3), A3 char(3))')
('table', 'S', 'S', 3, 'CREATE TABLE S (A1 char(3), A2 char(3), A3 char(3))')
('table', 'T', 'T', 4, 'CREATE TABLE T (B1 char(3), B2 char(3), B3 char(3))')
('table', 'U', 'U', 5, 'CREATE TABLE U (C1 char(3), C2 char(3))')
('table', 'V', 'V', 6, 'CREATE TABLE V (D1 char(3), A2 char(3))')
('table', 'Moje', 'Moje', 7, 'CREATE TABLE Moje (\nID INTEGER PRIMARY KEY,\nTIME INTEGER NOT NULL,\nTEXT TEXT )')

In [4]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM R')

for row in cursor:
    print(row)
    
cursor.close()

('v1', 'v2', 'v3')
('v4', 'v5', 'v6')

In [5]:
'''CREATE TABLE [IF NOT EXISTS] [schema_name].table_name (
column_1 data_type PRIMARY KEY,
column_2 data_type NOT NULL,
column_3 data_type DEFAULT 0,
table_constraints
) [WITHOUT ROWID];'''

'CREATE TABLE [IF NOT EXISTS] [schema_name].table_name (\ncolumn_1 data_type PRIMARY KEY,\ncolumn_2 data_type NOT NULL,\ncolumn_3 data_type DEFAULT 0,\ntable_constraints\n) [WITHOUT ROWID];'

In [6]:
cursor = conn.cursor()
cursor.execute('''DROP TABLE Moje;''')
cursor.close()

In [7]:
cursor = conn.cursor()
cursor.execute('''CREATE TABLE Moje (
ID INTEGER PRIMARY KEY,
TIME INTEGER NOT NULL,
TEXT TEXT );''')
cursor.close()

In [8]:
cursor = conn.cursor()
cursor.execute('''INSERT INTO Moje(ID, TIME, TEXT) VALUES (NULL, DATE(),'Energylandia');''')
cursor.execute('''INSERT INTO Moje(ID, TIME, TEXT) VALUES (NULL, "2020-01-02",'Energylandia');''')
cursor.close()

In [9]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM Moje')

for row in cursor:
    print(row)
    
cursor.close()

(1, '2021-03-14', 'Energylandia')
(2, '2020-01-02', 'Energylandia')

In [10]:
cursor = conn.cursor()
cursor.execute('''DELETE FROM Moje WHERE ID = '8D1E0014-A25E-4665-9426-38486FA92E91' ''')  
cursor.close()

In [11]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM Moje')

for row in cursor:
    print(row)
    
cursor.close()

(1, '2021-03-14', 'Energylandia')
(2, '2020-01-02', 'Energylandia')

In [12]:
cursor = conn.cursor()
cursor.execute('''DELETE FROM Moje WHERE TIME >= '2020-07-23 07:30:00' ''')  
cursor.close()

In [13]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM Moje')

for row in cursor:
    print(row)
    
cursor.close()

(2, '2020-01-02', 'Energylandia')

In [14]:
cursor = conn.cursor()
cursor.execute('SELECT * FROM Moje')

num_fields = len(cursor.description)
field_names = [i[0] for i in cursor.description]

cursor.close()

In [15]:
field_names

['ID', 'TIME', 'TEXT']

In [16]:
import pandas as pd

In [17]:
cursor = conn.cursor()
sql = "SELECT * FROM Moje"
cursor.execute(sql)

num_fields = len(cursor.description)
field_names = [i[0] for i in cursor.description]

results = cursor.fetchall()
print(results)

cursor.close()

[(2, '2020-01-02', 'Energylandia')]

In [18]:
results.__class__

list

In [19]:
results[0].__class__

tuple

In [20]:
# prevede spatne, je tam jen jeden sloupec s typem pyodbc.Row
df = pd.DataFrame(results)

In [21]:
df

   0           1             2
0  2  2020-01-02  Energylandia

In [22]:
df[0][0].__class__

numpy.int64

In [23]:
# prevede spravne
df = pd.DataFrame((tuple(t) for t in results))

In [24]:
df

   0           1             2
0  2  2020-01-02  Energylandia

In [25]:
df.columns = field_names

In [26]:
df

   ID        TIME          TEXT
0   2  2020-01-02  Energylandia

In [27]:
df.dtypes

ID       int64
TIME    object
TEXT    object
dtype: object

In [28]:
df['TIME'] = pd.to_datetime(df['TIME'], format='%Y-%m-%d')

In [29]:
df.dtypes

ID               int64
TIME    datetime64[ns]
TEXT            object
dtype: object